# Importing the basic libraries for reading, understanding and exploring the data

In [3]:
import pandas as pd

- We are importing the pandas library which is used most commonly for reading, understanding, exploring and and modifying the dataset. we are giving it a name which is pd and whenever we want to use pandas we can call it using pd.

In [4]:
cars = pd.read_csv(r"E:\Python Task\Cars.csv")

- In this line we are importing a dataset to python using are pandas library, if you look at the code you will see that it is a "CSV" file and then we are storing the imported dataset in a variable name "cars", we can store the imported data into any variable depending upon our need and choice

In [5]:
cars

     HP        MPG  VOL          SP         WT
0    49  53.700681   89  104.185353  28.762059
1    55  50.013401   92  105.461264  30.466833
2    55  50.013401   92  105.461264  30.193597
3    70  45.696322   92  113.461264  30.632114
4    53  50.504232   92  104.461264  29.889149
..  ...        ...  ...         ...        ...
76  322  36.900000   50  169.598513  16.132947
77  238  19.197888  115  150.576579  37.923113
78  263  34.000000   50  151.598513  15.769625
79  295  19.833733  119  167.944460  39.423099
80  236  12.101263  107  139.840817  34.948615

[81 rows x 5 columns]

- By simply typing the name of the variable (cars in our case) in which we have stored our dataset we can access the content of the dataset

In [6]:
cars.head()

   HP        MPG  VOL          SP         WT
0  49  53.700681   89  104.185353  28.762059
1  55  50.013401   92  105.461264  30.466833
2  55  50.013401   92  105.461264  30.193597
3  70  45.696322   92  113.461264  30.632114
4  53  50.504232   92  104.461264  29.889149

- .head() function when used with the variable (cars in our case) gives us the top 5 values of our dataset

In [8]:
cars.tail()

     HP        MPG  VOL          SP         WT
76  322  36.900000   50  169.598513  16.132947
77  238  19.197888  115  150.576579  37.923113
78  263  34.000000   50  151.598513  15.769625
79  295  19.833733  119  167.944460  39.423099
80  236  12.101263  107  139.840817  34.948615

- .tail() similar to .head when used with the variable (cars in our case) gives us the botton 5 values of our dataset

In [9]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   HP      81 non-null     int64
 1   MPG     81 non-null     float64
 2   VOL     81 non-null     int64
 3   SP      81 non-null     float64
 4   WT      81 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 3.3 KB

- .info() when used with the variable (cars in our case) tells us some basic information about the dataset

In [10]:
cars.dtypes

HP       int64
MPG    float64
VOL      int64
SP     float64
WT     float64
dtype: object

- .dtypes when used with the variable (cars in our case) tells us about the data types of each column of the dataset

In [11]:
cars.describe()

               HP        MPG         VOL          SP         WT
count   81.000000  81.000000   81.000000   81.000000  81.000000
mean   117.469136  34.422076   98.765432  121.540272  32.412577
std     57.113502   9.131445   22.301497   14.181432   7.492813
min     49.000000  12.101263   50.000000   99.564907  15.712859
25%     84.000000  27.856252   89.000000  113.829145  29.591768
50%    100.000000  35.152727  101.000000  118.208698  32.734518
75%    140.000000  39.531633  113.000000  126.404312  37.392524
max    322.000000  53.700681  160.000000  169.598513  52.997752

- .describe() when used with the variable (cars in our case) tells us the important statical highlights about the dataset